Question 1:

In [1]:
import numpy as np
import pandas as pd

C:\Users\vmgem\AppData\Local\Temp\ipykernel_20204\3269992828.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
df = pd.read_csv("Exercise2/loans.csv")
df.columns

Index(['Loan ID', 'Customer ID', 'Loan Status', 'Current Loan Amount', 'Term',
       'Credit Score', 'Annual Income', 'Years in current job',
       'Home Ownership', 'Purpose', 'Monthly Debt', 'Years of Credit History',
       'Months since last delinquent', 'Number of Open Accounts',
       'Number of Credit Problems', 'Current Credit Balance',
       'Maximum Open Credit', 'Bankruptcies', 'Tax Liens'],
      dtype='object')

In [4]:
df = df.drop(["Customer ID"], axis=1)
df.head

<bound method NDFrame.head of                                      Loan ID Loan Status  Current Loan Amount  \
0       14dd8831-6af5-400b-83ec-68e61888a048  Fully Paid             445412.0
1       4771cc26-131a-45db-b5aa-537ea4ba5342  Fully Paid             262328.0
2       4eed4e6a-aa2f-4c91-8651-ce984ee8fb26  Fully Paid           99999999.0
3       77598f7b-32e7-4e3b-a6e5-06ba0d98fe8a  Fully Paid             347666.0
4       d4062e70-befa-4995-8643-a0de73938182  Fully Paid             176220.0
...                                      ...         ...                  ...
100509                                   NaN         NaN                  NaN
100510                                   NaN         NaN                  NaN
100511                                   NaN         NaN                  NaN
100512                                   NaN         NaN                  NaN
100513                                   NaN         NaN                  NaN

              Term  Credit Score  Annual Income Years in current job  \
0       Short Term         709.0      1167493.0              8 years
1       Short Term           NaN            NaN            10+ years
2       Short Term         741.0      2231892.0              8 years
3        Long Term         721.0       806949.0              3 years
4       Short Term           NaN            NaN              5 years
...            ...           ...            ...                  ...
100509         NaN           NaN            NaN                  NaN
100510         NaN           NaN            NaN                  NaN
100511         NaN           NaN            NaN                  NaN
100512         NaN           NaN            NaN                  NaN
100513         NaN           NaN            NaN                  NaN

       Home Ownership             Purpose  Monthly Debt  \
0       Home Mortgage   Home Improvements       5214.74
1       Home Mortgage  Debt Consolidation      33295.98
2            Own Home  Debt Consolidation      29200.53
3            Own Home  Debt Consolidation       8741.90
4                Rent  Debt Consolidation      20639.70
...               ...                 ...           ...
100509            NaN                 NaN           NaN
100510            NaN                 NaN           NaN
100511            NaN                 NaN           NaN
100512            NaN                 NaN           NaN
100513            NaN                 NaN           NaN

        Years of Credit History  Months since last delinquent  \
0                          17.2                           NaN
1                          21.1                           8.0
2                          14.9                          29.0
3                          12.0                           NaN
4                           6.1                           NaN
...                         ...                           ...
100509                      NaN                           NaN
100510                      NaN                           NaN
100511                      NaN                           NaN
100512                      NaN                           NaN
100513                      NaN                           NaN

        Number of Open Accounts  Number of Credit Problems  \
0                           6.0                        1.0
1                          35.0                        0.0
2                          18.0                        1.0
3                           9.0                        0.0
4                          15.0                        0.0
...                         ...                        ...
100509                      NaN                        NaN
100510                      NaN                        NaN
100511                      NaN                        NaN
100512                      NaN                        NaN
100513                      NaN                        NaN

        Current Credit Balance  Maximum Open Credit  Bankruptcies  Tax Liens
0                     228190.0             416746.0           1.0        0.0
1                     229976.0             850784.0           0.0        0.0
2                     297996.0             750090.0           0.0        0.0
3                     256329.0             386958.0           0.0        0.0
4                     253460.0             427174.0           0.0        0.0
...                        ...                  ...           ...        ...
100509                     NaN                  NaN           NaN        NaN
100510                     NaN                  NaN           NaN        NaN
100511                     NaN                  NaN           NaN        NaN
100512                     NaN                  NaN           NaN        NaN
100513                     NaN                  NaN           NaN        NaN

[100514 rows x 18 columns]>

##### Remove rows with loan amount >= 99999999
##### Remove rows from 'Annual income' with NaN

In [5]:
filter_df = df[df['Current Loan Amount'] < 99999999]
df_dropna_AnnualIncome = filter_df['Annual Income'].dropna

##### *Extra* Use average income as values instead of Nan

In [6]:
filter_df['Annual Income'].fillna(filter_df['Annual Income'].mean(), inplace=True)
df = filter_df

C:\Users\vmgem\AppData\Local\Temp\ipykernel_20204\2240227758.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filter_df['Annual Income'].fillna(filter_df['Annual Income'].mean(), inplace=True)

##### Get average Cureenct Loan Amount
##### Highest and lowest Annual Income

In [8]:
mean_current_loan = df['Current Loan Amount'].mean()
lowest_annual_income = df['Annual Income'].min()
highest_annual_income = df['Annual Income'].max()
home_owner_value = df[df['Loan ID'] == 'bbf87a87-22cd-4d10-bd9b-7a9cc1b6e59d']
home_owner_value['Home Ownership']

491    Own Home
Name: Home Ownership, dtype: object

##### Create new field 'Actual Annual income'
##### Get 'Actual Annual income' from ID

In [9]:
df['Actual Annual Income'] = df['Monthly Debt'] * 12

actual_annual_income = df[df['Loan ID'] == '76fa89b9-e6a8-49af-afa1-8151315aba8e']
actual_annual_income['Actual Annual Income']

C:\Users\vmgem\AppData\Local\Temp\ipykernel_20204\4016155025.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Actual Annual Income'] = df['Monthly Debt'] * 12

109     254466.24
2216    254466.24
Name: Actual Annual Income, dtype: float64

#### Get Loan ID with small actual income

In [10]:
smallest_actual_income = df.loc[df['Actual Annual Income'].idxmin()]['Loan ID']
smallest_actual_income

'da795dc7-9960-49d9-9ef4-94a28a51f168'

In [11]:
longterm_loans = df['Term'].value_counts()['Long Term']
longterm_loans

bankruptcies = df[df['Bankruptcies'] > 1]['Loan ID'].count()
bankruptcies

476

##### Number of short term loans for home improvement

In [28]:
df.query("Term=='Short Term'")["Purpose"].value_counts()['Home Improvements']

3490

##### Number of unique loan purposes
##### The most unique loan purpose

In [31]:
df['Purpose'].nunique()

16

In [53]:
df['Purpose'].value_counts().head(3)

Purpose
Debt Consolidation    69506
other                  5409
Home Improvements      5124
Name: count, dtype: int64

In [54]:
# Correlations
# There is a weak positive correlation between 'Annual income and number of open accounts'. This means an increase in annual income would result to a weak increase in openned accouns and vice versa. Thus there are other more significant factors to be considered.

# There is as well a strong positive correlation between 'Number of credit problems and bankruptcies'. This means increase in credit problems would signifcantly translate to increase bankruptcy rate.

In [55]:
df['Annual Income'].corr(df['Number of Open Accounts'])

0.12705769402525527

In [56]:
df['Number of Credit Problems'].corr(df['Bankruptcies'])

0.7507485199510444

#####   Question 2:

In [57]:
# Question 2:

df = pd.read_csv("Exercise2/purchases.csv")
df.columns

Index(['Creation Date', 'Purchase Date', 'Fiscal Year', 'LPA Number',
       'Purchase Order Number', 'Requisition Number', 'Acquisition Type',
       'Acquisition Method', 'Department Name', 'Supplier Code',
       'Supplier Name', 'Supplier Qualifications', 'Supplier Zip Code',
       'CalCard', 'Item Name', 'Item Description', 'Quantity', 'Unit Price',
       'Total Price', 'Classification Codes', 'Normalized UNSPSC',
       'Commodity Title', 'Class', 'Class Title', 'Family', 'Family Title',
       'Segment', 'Segment Title', 'Location'],
      dtype='object')

In [58]:
total_price_sum = df[df['Purchase Order Number'] == '018H2015']
total_price_sum['Total Price'].sum()

1245.0400000000002

In [59]:
purchase_item = df[df['Purchase Order Number'] == '3176273']
purchase_item['Item Name']

103    PC Desktop
Name: Item Name, dtype: object

In [60]:
purchase_item['Item Description']

103    HP Prodesk 600
Name: Item Description, dtype: object

In [61]:
purchase_data = df[df['Fiscal Year'] == '2013'].count
purchase_data

<bound method DataFrame.count of Empty DataFrame
Columns: [Creation Date, Purchase Date, Fiscal Year, LPA Number, Purchase Order Number, Requisition Number, Acquisition Type, Acquisition Method, Department Name, Supplier Code, Supplier Name, Supplier Qualifications, Supplier Zip Code, CalCard, Item Name, Item Description, Quantity, Unit Price, Total Price, Classification Codes, Normalized UNSPSC, Commodity Title, Class, Class Title, Family, Family Title, Segment, Segment Title, Location]
Index: []

[0 rows x 29 columns]>

In [62]:
#df['Department Name'].value_counts().nlargest(5)
df['Department Name'].value_counts()[:5]

Department Name
Corrections and Rehabilitation, Department of    10891
Correctional Health Care Services                 6593
Water Resources, Department of                    4582
Forestry and Fire Protection, Department of       4526
State Hospitals, Department of                    4281
Name: count, dtype: int64

In [63]:
df.nlargest(3, ['Total Price'])['Department Name']

#df.loc[df['Total Price'].nlargest(3)]['Department Name']

7480     Health Care Services, Department of
45137           Public Health, Department of
35511    Health Care Services, Department of
Name: Department Name, dtype: object

In [64]:
df_Department_name = df.sort_values('Department Name')

##### Repalace $ and convert to float

In [65]:
# Repalace $ and convert to float

df['Unit Price'] = df['Unit Price'].replace({'\$': '', ',': ''}, regex=True).astype(float)
df['Unit Price'].head

<bound method NDFrame.head of 0            0.60
1        12587.05
2          199.00
3            4.95
4            1.00
           ...
62652      100.50
62653      245.00
62654      245.00
62655    20475.00
62656     1181.44
Name: Unit Price, Length: 62657, dtype: float64>

### Extra

In [66]:
# Number of IT Goods with Total Price > 50000

df.loc[(df['Acquisition Type'] == 'IT Goods')  & (df['Total Price'] > 50000)].shape

(698, 29)

In [67]:
# number of Purchases related to IT.

df.loc[df['Acquisition Type'].str.startswith('IT')].shape

(9558, 29)

In [68]:
# Other extra
# Dataframe with purchases =< 0.

Total_Price_Plus = df[df['Total Price'] > 0]
Total_Price_Plus

,Creation Date,Purchase Date,Fiscal Year,LPA Number,Purchase Order Number,Requisition Number,Acquisition Type,Acquisition Method,Department Name,Supplier Code,...,Classification Codes,Normalized UNSPSC,Commodity Title,Class,Class Title,Family,Family Title,Segment,Segment Title,Location
0,09/05/2012,08/31/2012,2012-2013,NaN,4500149558,NaN,NON-IT Goods,Formal Competitive,"Corrections and Rehabilitation, Department of",48199.0,...,50405625,50405625.0,Jalapeno peppers,50405600.0,Peppers,50400000.0,Fresh vegetables,50000000.0,Food Beverage and Tobacco Products,"93706\n(36.675079, -119.865393)"
1,10/18/2012,10/18/2012,2012-2013,NaN,4500156192,NaN,NON-IT Goods,Informal Competitive,"Corrections and Rehabilitation, Department of",1327540.0,...,50301541,50301541.0,Ida red apples,50301500.0,Apples,50300000.0,Fresh fruits,50000000.0,Food Beverage and Tobacco Products,"91360\n(34.210392, -118.874313)"
2,10/17/2012,10/17/2012,2012-2013,NaN,4500156124,NaN,NON-IT Goods,Fair and Reasonable,Correctional Health Care Services,45803.0,...,55101506,55101506.0,Magazines,55101500.0,Printed publications,55100000.0,Printed media,55000000.0,Published Products,"95827\n(38.563097, -121.328511)"
3,10/30/2012,10/24/2012,2012-2013,NaN,S2556056,NaN,NON-IT Goods,Informal Competitive,"Parks & Recreation, Department of",1746707.0,...,10121505,10121505.0,Hay,10121500.0,Livestock feed,10120000.0,Animal feed,10000000.0,Live Plant and Animal Material and Accessories...,NaN
4,11/14/2012,11/14/2012,2012-2013,NaN,4500159228,NaN,NON-IT Goods,Informal Competitive,"Corrections and Rehabilitation, Department of",1065902.0,...,50201706,50201706.0,Coffee,50201700.0,Coffee and tea,50200000.0,Beverages,50000000.0,Food Beverage and Tobacco Products,"95696\n(38.43, -122.02)"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
62652,08/22/2013,08/23/2013,2013-2014,1-10-75-60A,S3863002,NaN,NON-IT Goods,Statewide Contract,"Parks & Recreation, Department of",1087660.0,...,44103103,44103103.0,Printer or facsimile toner,44103100.0,Printer and facsimile and photocopier supplies,44100000.0,Office machines and their supplies and accesso...,44000000.0,Office Equipment and Accessories and Supplies,"95814\n(38.580427, -121.494396)"
62653,08/22/2013,08/23/2013,2013-2014,1-10-75-60A,S3863002,NaN,NON-IT Goods,Statewide Contract,"Parks & Recreation, Department of",1087660.0,...,44103103,44103103.0,Printer or facsimile toner,44103100.0,Printer and facsimile and photocopier supplies,44100000.0,Office machines and their supplies and accesso...,44000000.0,Office Equipment and Accessories and Supplies,"95814\n(38.580427, -121.494396)"
62654,08/22/2013,08/23/2013,2013-2014,1-10-75-60A,S3863002,NaN,NON-IT Goods,Statewide Contract,"Parks & Recreation, Department of",1087660.0,...,44103103,44103103.0,Printer or facsimile toner,44103100.0,Printer and facsimile and photocopier supplies,44100000.0,Office machines and their supplies and accesso...,44000000.0,Office Equipment and Accessories and Supplies,"95814\n(38.580427, -121.494396)"
62655,08/24/2013,08/23/2013,2013-2014,NaN,2U3H1109,NaN,NON-IT Services,Emergency Purchase,"Forestry and Fire Protection, Department of",1015235.0,...,76122402,76122402.0,Equipment usage fee,76122400.0,Refuse disposal and treatment fees,76120000.0,Refuse disposal and treatment,76000000.0,Industrial Cleaning Services,"95901\n(39.195356, -121.495425)"
62656,08/23/2013,08/23/2013,2013-2014,NaN,4500195481,NaN,NON-IT Goods,Informal Competitive,Correctional Health Care Services,1763613.0,...,12161501,12161501.0,Affinity labels,12161500.0,Indicators and Reagents,12160000.0,Additives,12000000.0,Chemicals including Bio Chemicals and Gas Mate...,NaN

In [69]:
# Total price sum and mean based on Acquisition type

Price_sum = Total_Price_Plus.groupby('Acquisition Type')['Total Price'].sum().astype('int64')
Price_sum

Acquisition Type
IT Goods                   213676581
IT Services               1156983637
IT Telecommunications         307903
NON-IT Goods              1034291622
NON-IT Services          30564202787
Name: Total Price, dtype: int64

In [70]:
Price_mean = Total_Price_Plus.groupby('Acquisition Type')['Total Price'].mean().astype('int64')
Price_mean

Acquisition Type
IT Goods                   28953
IT Services               682989
IT Telecommunications      51317
NON-IT Goods               26087
NON-IT Services          2481062
Name: Total Price, dtype: int64

In [71]:
# Acquisition type with largest sum

Price_sum_largest = Total_Price_Plus.groupby('Acquisition Type')['Total Price'].sum().astype('int64').nlargest(2)
Price_sum_largest

Acquisition Type
NON-IT Services    30564202787
IT Services         1156983637
Name: Total Price, dtype: int64

In [72]:
# Acquisition type with largest mean

Price_mean_largest = Total_Price_Plus.groupby('Acquisition Type')['Total Price'].mean().astype('int64').nlargest(2)
Price_mean_largest

Acquisition Type
NON-IT Services    2481062
IT Services         682989
Name: Total Price, dtype: int64

#####  Question 3

In [76]:
# Question 3

df = pd.read_csv("Exercise2/data_salaries_india.csv")
#df.head

In [77]:
# To clean the data by remocing the Indian rupee sign and '/yr' string attached
# Next I drop the original column 'Salary' with included the unwanted signs

df['Yearly Salary'] = df['Salary'].replace({'₹': '', '/yr': '', ',': ''}, regex=True).astype(float)
df = df.drop('Salary', axis=1)

In [78]:
# Most common values in 'Job Title', 'Companies', 'Location'

df['Job Title'].value_counts().nlargest().to_frame()

                           count
Job Title
Data Scientist              2165
Data Analyst                1167
Data Engineer                948
Machine Learning Engineer    683
Data Science                  54

In [79]:
df['Company Name'].value_counts().nlargest()[:30].to_frame()

                           count
Company Name
Tata Consultancy Services     51
Accenture                     39
Amazon                        35
Fresher                       31
First Student                 30

In [80]:
df['Location'].value_counts().nlargest().to_frame()

           count
Location
Bangalore   1858
Pune         966
Hyderabad    786
New Delhi    781
Mumbai       736

In [81]:
# Data is said to be imbalance when it has highly asymmetric distribution. That is, there is very high frequency for few variables, with others seen as statistically minor.
# In an imbalanced dataset for training for example, one or few buckets make up a large portion of the training dataset. With respect to our dataset, it is not balance because 'Data analysts and Data scientist account for over 60% of 'Job titles'.

##### Extra

In [104]:
# Combining job titles which are almost thesame
df.loc[df['Job Title'].str.startswith('Machine Learning Data As')]

,Company Name,Job Title,Role,Salaries Reported,Location,Yearly Salary,Manager Role
236,Amazon,Machine Learning Data Associate II,Specialist,5,Hyderabad,383213.0,0
689,Amazon,Machine Learning Data Associate,Specialist,38,Hyderabad,275841.0,0
1681,Amazon,Machine Learning Data Associate II,Specialist,1,New Delhi,329439.0,0
3543,Amazon,Machine Learning Data Associate I,Specialist,9,Hyderabad,258596.0,0

In [105]:
df.columns

Index(['Company Name', 'Job Title', 'Role', 'Salaries Reported', 'Location',
       'Yearly Salary', 'Manager Role'],
      dtype='object')

In [118]:
def join_unique(items):
    return ','.join(set(items))

df_joined = df.groupby(['Job Title']).agg({'Company Name': join_unique, 'Role': join_unique, 'Salaries Reported': 'mean', 'Location': join_unique, 'Yearly Salary': 'mean'}).reset_index
df_joined

<bound method DataFrame.reset_index of                                                                                Company Name  \
Job Title
Associate Machine Learning Engineer                                             Techolution
CEO                                                                                Mindtree
Data Analyst                              Michelin,WebDirekt,Accentue,CBRE,Prithvi Nath,...
Data Engineer                             Q3 Technologies,Michelin,Kagool,Software Data ...
Data Science                              Sciffer Analytics,Unscrambl,Ecozen Solutions,S...
Data Science Associate                                                        ZS Associates
Data Science Consultant                                                       ZS Associates
Data Science Lead                                                              Schlumberger
Data Science Manager                                                          ZS Associates
Data Scientist                            Wave Infosoft,Invendis Technologies India,Vert...
Data Scientist - Trainee                                                            Abzooba
Junior Data Scientist                     Innomatics Research Labs,GeoSpoc,Artificial Br...
Lead Data Scientist                       BNY Mellon,Zensar Technologies,Wipro,ADP,Accen...
Machine Learning Associate                                                           Amazon
Machine Learning Consultant                                           Extend Future,Infosys
Machine Learning Data Analyst                                                        Amazon
Machine Learning Data Associate                                                      Amazon
Machine Learning Data Associate I                                                    Amazon
Machine Learning Data Associate II                                                   Amazon
Machine Learning Developer                                   Decimal Point Analytics,MyWays
Machine Learning Engineer                 Unknowns,InfinityLabs,difference-engine.ai,Ora...
Machine Learning Engineer/Data Scientist                                    Unknown Company
Machine Learning Scientist                                       TaiyōAI,Myraa Technologies
Machine Learning Software Engineer                                 ThinkBumblebee Analytics
National Director                                                                    Amazon
Senior Data Scientist                     Vodafone,Tata Consultancy Services,XPO Logisti...
Senior Machine Learning Engineer          Aditya Birla Group,Optum,CognitiveScale,Techol...
Software Engineer - Machine Learning                         Market Pulse Technologies,HSBC

                                                        Role  \
Job Title
Associate Machine Learning Engineer               Specialist
CEO                                                  Manager
Data Analyst                              Specialist,Manager
Data Engineer                             Specialist,Manager
Data Science                              Specialist,Manager
Data Science Associate                            Specialist
Data Science Consultant                           Specialist
Data Science Lead                                 Specialist
Data Science Manager                              Specialist
Data Scientist                            Specialist,Manager
Data Scientist - Trainee                  Specialist,Manager
Junior Data Scientist                     Specialist,Manager
Lead Data Scientist                               Specialist
Machine Learning Associate                        Specialist
Machine Learning Consultant                       Specialist
Machine Learning Data Analyst                     Specialist
Machine Learning Data Associate                   Specialist
Machine Learning Data Associate I                 Specialist
Machine Learning Data Associate II                Specialist
Machine Learning Developer                        Specialist
Machine Learning Engineer                 Specialist,Manager
Machine Learning Engineer/Data Scientist  Specialist,Manager
Machine Learning Scientist                        Specialist
Machine Learning Software Engineer                Specialist
National Director                                    Manager
Senior Data Scientist                     Specialist,Manager
Senior Machine Learning Engineer          Specialist,Manager
Software Engineer - Machine Learning      Specialist,Manager

                                          Salaries Reported  \
Job Title
Associate Machine Learning Engineer                3.000000
CEO                                                1.000000
Data Analyst                                       4.051414
Data Engineer                                      2.433544
Data Science                                       1.129630
Data Science Associate                             9.000000
Data Science Consultant                            5.000000
Data Science Lead                                  2.000000
Data Science Manager                               2.000000
Data Scientist                                     2.218014
Data Scientist - Trainee                           1.500000
Junior Data Scientist                              1.090909
Lead Data Scientist                                1.333333
Machine Learning Associate                         6.000000
Machine Learning Consultant                        1.000000
Machine Learning Data Analyst                      3.000000
Machine Learning Data Associate                   38.000000
Machine Learning Data Associate I                  9.000000
Machine Learning Data Associate II                 3.000000
Machine Learning Developer                         1.000000
Machine Learning Engineer                          1.389458
Machine Learning Engineer/Data Scientist           1.000000
Machine Learning Scientist                         1.000000
Machine Learning Software Engineer                 1.000000
National Director                                  1.000000
Senior Data Scientist                              1.200000
Senior Machine Learning Engineer                   2.500000
Software Engineer - Machine Learning               1.000000

                                                                           Location  \
Job Title
Associate Machine Learning Engineer                                       Hyderabad
CEO                                                                       Bangalore
Data Analyst                              Mumbai,Hyderabad,Pune,New Delhi,Bangalore
Data Engineer                             Mumbai,Hyderabad,Pune,New Delhi,Bangalore
Data Science                                                                   Pune
Data Science Associate                                                         Pune
Data Science Consultant                                                        Pune
Data Science Lead                                                              Pune
Data Science Manager                                                           Pune
Data Scientist                            Mumbai,Hyderabad,Pune,New Delhi,Bangalore
Data Scientist - Trainee                                                       Pune
Junior Data Scientist                                                          Pune
Lead Data Scientist                                                            Pune
Machine Learning Associate                                                Hyderabad
Machine Learning Consultant                                                    Pune
Machine Learning Data Analyst                                             Hyderabad
Machine Learning Data Associate                                           Hyderabad
Machine Learning Data Associate I                                         Hyderabad
Machine Learning Data Associate II                              Hyderabad,New Delhi
Machine Learning Developer                                                   Mumbai
Machine Learning Engineer                 Mumbai,Hyderabad,Pune,New Delhi,Bangalore
Machine Learning Engineer/Data Scientist                                       Pune
Machine Learning Scientist                                                   Mumbai
Machine Learning Software Engineer                                             Pune
National Director                                                         Bangalore
Senior Data Scientist                                                          Pune
Senior Machine Learning Engineer                                   Mumbai,Hyderabad
Software Engineer - Machine Learning                                    Mumbai,Pune

                                          Yearly Salary
Job Title
Associate Machine Learning Engineer        4.643720e+05
CEO                                        7.444533e+07
Data Analyst                               7.543779e+05
Data Engineer                              1.230734e+06
Data Science                               4.674097e+05
Data Science Associate                     1.203913e+06
Data Science Consultant                    2.671464e+06
Data Science Lead                          4.068310e+06
Data Science Manager                       4.619021e+06
Data Scientist                             1.502054e+06
Data Scientist - Trainee                   1.338706e+06
Junior Data Scientist                      8.667148e+05
Lead Data Scientist                        1.852189e+06
Machine Learning Associate                 2.951140e+05
Machine Learning Consultant                7.064010e+05
Machine Learning Data Analyst              3.613780e+05
Machine Learning Data Associate            2.758410e+05
Machine Learning Data Associate I          2.585960e+05
Machine Learning Data Associate II         3.563260e+05
Machine Learning Developer                 5.811190e+05
Machine Learning Engineer                  1.041159e+06
Machine Learning Engineer/Data Scientist   1.575782e+06
Machine Learning Scientist                 1.701180e+05
Machine Learning Software Engineer         1.397347e+06
National Director                          3.579195e+07
Senior Data Scientist                      2.054160e+06
Senior Machine Learning Engineer           1.711217e+06
Software Engineer - Machine Learning       2.984858e+06  >

In [83]:
#agg_title = {'Job Title': 'Machine Learning Data ASS%', 'Salaries Reported': 'sum', }
df.loc[df['Job Title'].str.startswith('Machine Learning Data As')]

#create new DataFrame by combining rows with same id values
#df_new = df.groupby(df['Job Title']).aggregate(agg_title)

,Company Name,Job Title,Role,Salaries Reported,Location,Yearly Salary
236,Amazon,Machine Learning Data Associate II,Specialist,5,Hyderabad,383213.0
689,Amazon,Machine Learning Data Associate,Specialist,38,Hyderabad,275841.0
1681,Amazon,Machine Learning Data Associate II,Specialist,1,New Delhi,329439.0
3543,Amazon,Machine Learning Data Associate I,Specialist,9,Hyderabad,258596.0

In [120]:
def join_unique(items):
    return ','.join(set(items))
def join_title(item):
    if df['Job Title'] == 'Machine Learning Data Associate I':
        return 'Machine Learning Associate'.join(set(item))
    if df['Job Title'] == 'Machine Learning Data Associate II':
        return 'Machine Learning Associate'.join(set(item))
    if df['Job Title'] == 'Machine Learning Associate':
        return 'Machine Learning Associate'.join(set(item))

df_joined = df.groupby((join_title) & (['Job Title'])).agg({'Company Name': join_unique, 'Role': join_unique, 'Salaries Reported': 'mean', 'Location': join_unique, 'Yearly Salary': 'mean'}).reset_index
df_joined

TypeError: unsupported operand type(s) for &: 'function' and 'list'

In [121]:
#**  To be checked, combining not working

In [125]:
# Check for missing values
# Replace missing values. We had just 4 missing values from column:'Company Name' and replaced with: 'Unknown Company'
# Check for outliers using '.describe()' function

df.isna().sum()
df['Company Name'].fillna('Unknown Company', inplace=True)

df.describe()

       Salaries Reported  Yearly Salary  Manager Role
count        5127.000000   5.127000e+03   5127.000000
mean            2.546909   1.232570e+06      0.157792
std             4.808232   1.816492e+06      0.364581
min             1.000000   1.081400e+04      0.000000
25%             1.000000   4.629770e+05      0.000000
50%             1.000000   8.239710e+05      0.000000
75%             2.000000   1.435941e+06      0.000000
max           105.000000   7.444533e+07      1.000000

##### We can observe from basic stats that there are outliers. With max. yearly salary of over 74 million compared to a min. slary of just 10000. This can be explain by differences in job roles: managers and specialist, and also company size. we can also see huge differences in reported salaries indicating very big diiferences in company size measured by number of employees.

In [126]:
# Remove outliers

df2 = df[(df['Yearly Salary'] > 100000) & (df['Yearly Salary'] < 10000000)]
df2
df2.describe()

       Salaries Reported  Yearly Salary  Manager Role
count        5039.000000   5.039000e+03   5039.000000
mean            2.571740   1.172381e+06      0.156182
std             4.846058   1.157423e+06      0.363064
min             1.000000   1.003260e+05      0.000000
25%             1.000000   4.779395e+05      0.000000
50%             1.000000   8.287770e+05      0.000000
75%             2.000000   1.434444e+06      0.000000
max           105.000000   9.666564e+06      1.000000

In [127]:
correlations = df2.corr(numeric_only=True)
correlations

                   Salaries Reported  Yearly Salary  Manager Role
Salaries Reported           1.000000      -0.085967     -0.114616
Yearly Salary              -0.085967       1.000000      0.499398
Manager Role               -0.114616       0.499398      1.000000

In [128]:
# Factorize and get corrlation
# Result shows a positive relation between manager role and salary
# Reported salaries inversely related to manager role, most reported roles arent for managers

values1, names1 = pd.factorize(df['Role'], sort=False)
df['Manager Role'] = values1

correlations = df.corr(numeric_only=True)
correlations

                   Salaries Reported  Yearly Salary  Manager Role
Salaries Reported           1.000000      -0.065193     -0.114675
Yearly Salary              -0.065193       1.000000      0.399192
Manager Role               -0.114675       0.399192      1.000000

In [129]:
# Using 'spearman' correlation shows stronger positive and negative corrlations between manager role to 'yearly salary' and
# 'salaries reported' respectively

df.corr(numeric_only=True, method='spearman')

                   Salaries Reported  Yearly Salary  Manager Role
Salaries Reported           1.000000      -0.072676     -0.254414
Yearly Salary              -0.072676       1.000000      0.430317
Manager Role               -0.254414       0.430317      1.000000

In [130]:
df5 = df

dummies = pd.get_dummies(df5['Role'], dtype=int)
df5 = pd.concat([df5, dummies], axis=1)
df5 = df5.drop("Role", axis=1)

correlations = df5.corr(numeric_only=True)
correlations

,Salaries Reported,Yearly Salary,Manager Role,Manager,Specialist
Salaries Reported,1.000000,-0.065193,-0.114675,-0.114675,0.114675
Yearly Salary,-0.065193,1.000000,0.399192,0.399192,-0.399192
Manager Role,-0.114675,0.399192,1.000000,1.000000,-1.000000
Manager,-0.114675,0.399192,1.000000,1.000000,-1.000000
Specialist,0.114675,-0.399192,-1.000000,-1.000000,1.000000

#### Extra task

In [131]:
df_quantiles = df['Yearly Salary'].quantile([0.25, 0.5, 0.75])
print(df_quantiles)

0.25     462977.0
0.50     823971.0
0.75    1435941.0
Name: Yearly Salary, dtype: float64

#####

In [132]:
# Salary range for; 
# 'quantile 0.25': 0 - 462977, 
# 462977 < 'quantile 0.5 lower' < 823971
# : 823971 <= 'quantile 0.5 upper' < 1435941[
# 1435941 <= 'quantile 0.75': <= 74445327

In [133]:
# I guess the data can be improve my multiplyingthe 'salaries reported' by the 'yearly salary' 
# to balance the effect of both when calculating correlation.
# We can as well reclassify the 'Role' into 'manager' and 'specialist'. 
#This would give us a an understanding of wage gap between the two roles. We can further reclassify this based on the city.

In [135]:
data_salaries = []

for i in range(df['Salaries Reported']):
    for j in range(int(df['Yearly Salary'][i])):
        new_df = [df['Company Name'][i], df['Job Title'][i], df['Role'][i], df['Salaries Reported'][i], df['Location'][i], df['Yearly Salary'][i], df['Manager Role'][i]]
        data_salaries.append(new_df)

modified_df = df(data_salaries, columns=['Company Name', 'Job Title', 'Role', 'Salaries Reported', 'Location', 'Yearly Salary', 'Manager Role'])
modified_df

TypeError: 'Series' object cannot be interpreted as an integer

#### Advance Tasks

In [137]:
# Tasks 1
# Read both csv files on videogames, combine them and save as 'combined.csv'.

df_vg1 = pd.read_csv("Exercise2/videogames1.csv")
df_vg2 = pd.read_csv("Exercise2/videogames2.csv")

combine_df = [df_vg1, df_vg2]
combined = pd.concat(combine_df)
display(combined)

combined.to_csv('combined.csv', index=False)

,Unnamed: 0,Name,Platform,Year_of_Release,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Critic_Score,Critic_Count,User_Score,User_Count,Developer,Rating
0,0,Wii Sports,Wii,2006.0,Sports,Nintendo,41.36,28.96,3.77,8.45,82.53,76.0,51.0,8.0,322.0,Nintendo,E
1,1,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,NaN,NaN,NaN,NaN,NaN,NaN
2,2,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.68,12.76,3.79,3.29,35.52,82.0,73.0,8.3,709.0,Nintendo,E
3,3,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.61,10.93,3.28,2.95,32.77,80.0,73.0,8.0,192.0,Nintendo,E
4,4,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8359,8359,Samurai Warriors: Sanada Maru,PS3,2016.0,Action,Tecmo Koei,0.00,0.00,0.01,0.00,0.01,NaN,NaN,NaN,NaN,NaN,NaN
8360,8360,LMA Manager 2007,X360,2006.0,Sports,Codemasters,0.00,0.01,0.00,0.00,0.01,NaN,NaN,NaN,NaN,NaN,NaN
8361,8361,Haitaka no Psychedelica,PSV,2016.0,Adventure,Idea Factory,0.00,0.00,0.01,0.00,0.01,NaN,NaN,NaN,NaN,NaN,NaN
8362,8362,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01,NaN,NaN,NaN,NaN,NaN,NaN
8363,8363,Winning Post 8 2016,PSV,2016.0,Simulation,Tecmo Koei,0.00,0.00,0.01,0.00,0.01,NaN,NaN,NaN,NaN,NaN,NaN

In [139]:
# Task 2
df_loans = pd.read_csv("Exercise2\loans.csv")

df_loans.insert(19, 'Income Group', True)
df_loans.columns

Index(['Loan ID', 'Customer ID', 'Loan Status', 'Current Loan Amount', 'Term',
       'Credit Score', 'Annual Income', 'Years in current job',
       'Home Ownership', 'Purpose', 'Monthly Debt', 'Years of Credit History',
       'Months since last delinquent', 'Number of Open Accounts',
       'Number of Credit Problems', 'Current Credit Balance',
       'Maximum Open Credit', 'Bankruptcies', 'Tax Liens', 'Income Group'],
      dtype='object')

In [140]:

df_loans['Annual Income'].fillna(df_loans['Annual Income'].mean(), inplace=True)

C:\Users\vmgem\AppData\Local\Temp\ipykernel_20204\4005398133.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_loans['Annual Income'].fillna(df_loans['Annual Income'].mean(), inplace=True)

In [141]:
# Create a funtion to categorize 'Annual Income' as instructed.
# Next, I call the function, apply() and assigned it to the column 'Income Group' which was earlier created

def annual_income_category(annual_income):
    if annual_income <= 25000:
        return '$25k or less'
    elif 25000 < annual_income <= 50000:
        return '$25k-$50k'
    elif 50000 < annual_income <= 100000:
        return '$50k-$100k'
    elif 100000 < annual_income <= 200000:
        return '$100k-$200k'
    else:
        return '$200k+'

df_loans['Income Group'] = df_loans['Annual Income'].apply(annual_income_category)

In [142]:
# Get the number of rows for all income groups

df_loans['Income Group'].value_counts().to_frame()

               count
Income Group
$200k+        100414
$100k-$200k       96
$50k-$100k         4

In [143]:
# Question 3
# Datasets for Gold and Silver prices
# Notice that there are some missing values
#import matplotlib

df_gold = pd.read_csv("D:\Intro Data Analytics\Exercise2\gold_price.csv")
df_silver = pd.read_csv("D:\Intro Data Analytics\Exercise2\silver_price.csv")

df_gold.isna().sum()

date       0
price    141
dtype: int64

In [144]:
# To proceed ith the analysis, I replace the NaN with the average value for each dataset. 

df_gold = df_gold['price'].fillna((df_gold['price'].mean()), inplace=True)
df_silver = df_silver['price'].fillna((df_silver['price'].mean()), inplace=True)

C:\Users\vmgem\AppData\Local\Temp\ipykernel_20204\797031185.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_gold = df_gold['price'].fillna((df_gold['price'].mean()), inplace=True)
C:\Users\vmgem\AppData\Local\Temp\ipykernel_20204\797031185.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_silver = df_silver['price'].fillna((df_silver['price'].mean()), inplace=True)

In [145]:
###  Problems with installing matplotlib, gonna check

cor = df_gold['price'].corr(df_silver['price'])

TypeError: 'NoneType' object is not subscriptable

In [146]:
# Question 4

df_bitcoin = pd.read_csv("D:\Intro Data Analytics\Exercise2\coin_Bitcoin.csv")
df_bitcoin.head()

,SNo,Name,Symbol,Date,High,Low,Open,Close,Volume,Marketcap
0,1,Bitcoin,BTC,2013-04-29 23:59:59,147.488007,134.000000,134.444000,144.539993,0.0,1.603769e+09
1,2,Bitcoin,BTC,2013-04-30 23:59:59,146.929993,134.050003,144.000000,139.000000,0.0,1.542813e+09
2,3,Bitcoin,BTC,2013-05-01 23:59:59,139.889999,107.720001,139.000000,116.989998,0.0,1.298955e+09
3,4,Bitcoin,BTC,2013-05-02 23:59:59,125.599998,92.281898,116.379997,105.209999,0.0,1.168517e+09
4,5,Bitcoin,BTC,2013-05-03 23:59:59,108.127998,79.099998,106.250000,97.750000,0.0,1.085995e+09

In [147]:
df_bitcoin.isna().sum()

SNo          0
Name         0
Symbol       0
Date         0
High         0
Low          0
Open         0
Close        0
Volume       0
Marketcap    0
dtype: int64

In [148]:
df_bitcoin.describe()

,SNo,High,Low,Open,Close,Volume,Marketcap
count,2991.000000,2991.000000,2991.000000,2991.000000,2991.000000,2.991000e+03,2.991000e+03
mean,1496.000000,6893.326038,6486.009539,6700.146240,6711.290443,1.090633e+10,1.208761e+11
std,863.571653,11642.832456,10869.032130,11288.043736,11298.141921,1.888895e+10,2.109438e+11
min,1.000000,74.561096,65.526001,68.504997,68.431000,0.000000e+00,7.784112e+08
25%,748.500000,436.179001,422.879486,430.445496,430.569489,3.036725e+07,6.305579e+09
50%,1496.000000,2387.610107,2178.500000,2269.889893,2286.409912,9.460360e+08,3.741503e+10
75%,2243.500000,8733.926948,8289.800459,8569.656494,8576.238715,1.592015e+10,1.499957e+11
max,2991.000000,64863.098908,62208.964366,63523.754869,63503.457930,3.509679e+11,1.186364e+12

In [149]:
correlations = df_bitcoin.corr(numeric_only=True)
correlations

,SNo,High,Low,Open,Close,Volume,Marketcap
SNo,1.000000,0.667028,0.671538,0.668551,0.669008,0.718164,0.664713
High,0.667028,1.000000,0.998841,0.999442,0.999417,0.810464,0.999094
Low,0.671538,0.998841,1.000000,0.998905,0.999291,0.803110,0.999072
Open,0.668551,0.999442,0.998905,1.000000,0.998646,0.808439,0.998382
Close,0.669008,0.999417,0.999291,0.998646,1.000000,0.807388,0.999709
Volume,0.718164,0.810464,0.803110,0.808439,0.807388,1.000000,0.809156
Marketcap,0.664713,0.999094,0.999072,0.998382,0.999709,0.809156,1.000000

In [150]:
df = df_bitcoin
df = df[(df['Close'] > 100000) & (df['Close'] < 10000000)]
df2
df2.describe()

       Salaries Reported  Yearly Salary  Manager Role
count        5039.000000   5.039000e+03   5039.000000
mean            2.571740   1.172381e+06      0.156182
std             4.846058   1.157423e+06      0.363064
min             1.000000   1.003260e+05      0.000000
25%             1.000000   4.779395e+05      0.000000
50%             1.000000   8.287770e+05      0.000000
75%             2.000000   1.434444e+06      0.000000
max           105.000000   9.666564e+06      1.000000